Catalogs/ДоговорыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДоговорыКонтрагентов</Name>
			<Hierarchical>true</Hierarchical>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомиссияТО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорРеализации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерБрони</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ДоговорыКонтрагентов/Forms/ПараметрыДоговора/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Ключ") Тогда
		Если ТипЗнч(Параметры.Ключ) = Тип("СправочникСсылка.ДоговорыКонтрагентов") тогда
			ЭТ_ОбщийМодуль2.СохранитьНастройку("ДоговорыКонтрагентов_ПарамертыДоговора",Новый Структура("ДатаНачала,КомиссияТО,ЭТ_ПризнакАгента,Заголовок,ЭлементТекущий",Параметры.Ключ.ДатаНачала,Параметры.Ключ.КомиссияТО,Параметры.Ключ.ЭТ_ПризнакАгента,Параметры.Ключ.Наименование+" "+Параметры.Ключ.Владелец.Наименование,Параметры.Ключ));
		КонецЕсли;		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СохранениеДанныхНаСерсере(Данные)
	ТекущийОбъект = Данные.ЭлементТекущий.ПолучитьОбъект();
	Если ТекущийОбъект = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	ТекущийОбъект.ДатаНачала = Данные.ДатаНачала;
	ТекущийОбъект.КомиссияТО = Данные.КомиссияТО;
	ТекущийОбъект.ЭТ_ПризнакАгента = Данные.ЭТ_ПризнакАгента;
	ТекущийОбъект.Записать();
	Возврат Истина;	
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруДанных()
	Возврат ЭТ_ОбщийМодуль2.ПолучитьНастройку("ДоговорыКонтрагентов_ПарамертыДоговора",Неопределено);
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Данные = ПолучитьСтруктуруДанных();
	ЭтаФорма.ДатаНачала = Данные.ДатаНачала;
	ЭтаФорма.КомиссияТО = Данные.КомиссияТО;
	ЭтаФорма.ЭТ_ПризнакАгента = Данные.ЭТ_ПризнакАгента;	
	ЭтаФорма.ЭлементТекущий = Данные.ЭлементТекущий;
	ЭтаФорма.Заголовок = "Параметры договора "+Данные.Заголовок;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаСохранения(Отказ)
	Структура = Новый Структура("ДатаНачала,КомиссияТО,ЭТ_ПризнакАгента,ЭлементТекущий",ЭтаФорма.ДатаНачала,ЭтаФорма.КомиссияТО, ЭтаФорма.ЭТ_ПризнакАгента, ЭтаФорма.ЭлементТекущий);
	Отказ = НЕ СохранениеДанныхНаСерсере(Структура);
КонецПроцедуры

&НаСервере
Процедура ОчисткаПередЗакрытием()
	ЭТ_ОбщийМодуль2.УдалитьНастройку("ДоговорыКонтрагентов_ПарамертыДоговора");	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаСохраненияИЗакрытия(Отказ)
	ОбработкаСохранения(Отказ);
	ОчисткаПередЗакрытием();
	Если НЕ Отказ Тогда 
		ЭтаФорма.Закрыть();
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Процедура ПриЗакрытииНаСервере()
	ЭТ_ОбщийМодуль2.УдалитьНастройку("ДоговорыКонтрагентов_ПарамертыДоговора");
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	ПриЗакрытииНаСервере();
КонецПроцедуры
